{
  "Session 2: Rethinking Self-Development 🌱": {
    "context": "This session explores the multifaceted meaning of 'self-development,' questioning whether it should prioritize marketable skills or personal enrichment. Particularly in Korea, the trend leans toward practical development for stability. Participants are encouraged to reflect on their personal growth motivations and the balance between utility and fulfillment.",
    "questions": [
      "When you hear 'self-development,' what first comes to your mind? Do you like the term, or do you have another way of describing it?",
      "Can you share a recent experience of self-development, whether it was practical (like learning a skill) or personal (such as a hobby)? How did it impact your life?",
      "Why do you think many Koreans prefer practical 'development' (skills, certifications) over personal 'cultivation' (arts, hobbies)? Do you find yourself following this trend, or do you resist it?",
      "In your opinion, what type of 'self-development' becomes more important as you grow older—improving skills, maintaining health, or nurturing your personality? Why?",
      "Imagine you could dedicate an entire year to cultivating a single skill or experience without worrying about practicality. What would you choose, and how might it enrich your life?"
    ]
  },
  "Session 3: Living Alone Boom — Is Solo Life Really Freedom? 🏠✨": {
    "context": "This session delves into the rising trend of solo living, often pursued for independence and personal freedom. Participants will reflect on the joys and challenges of solitude, the meaning of independence, and how solo living can shape one's identity and lifestyle.",
    "questions": [
      "Do you enjoy spending time alone? What activities or moments do you particularly cherish when you're by yourself?",
      "Have you ever thought about living alone, even briefly? What about the idea appeals to you or makes you hesitate?",
      "What do you think is the most valuable lesson someone could learn by living alone? Do you have any observations from your own experience or from friends who live alone?",
      "In your opinion, is the freedom of living alone always beneficial, or could it lead to challenges like loneliness or isolation? How would you personally handle these challenges?",
      "Imagine designing your perfect living space for yourself—what elements would you include to ensure comfort, happiness, and a sense of freedom?"
    ]
  }
}