{
  "Session 1: Life in Motion: Exploring 'A Rolling Stone Gathers No Moss' 🌿": {
    "context": "The proverb 'A rolling stone gathers no moss' has sparked intriguing discussions for centuries, reflecting two contrasting perspectives on life. On one hand, it suggests that constant movement keeps life exciting and prevents stagnation. On the other hand, it implies that continuous change might hinder stability, deep relationships, and meaningful experiences. Today, let's explore our personal stories and perspectives about finding balance between adventure and stability.",
    "questions": [
      "Are you more of a 'rolling stone,' always seeking new experiences, or do you prefer staying rooted in one place? Share why you feel this way.",
      "Can you recall a time when constantly moving or changing your situation brought you positive growth or unexpected challenges?",
      "How do you think frequent changes in life (jobs, cities, relationships) affect our ability to form deep connections and friendships?",
      "In your opinion, is it possible to achieve both excitement from new experiences and stability from long-term commitments? How have you observed this in your own life or those around you?",
      "Reflecting on your experiences abroad or in different environments, how has being a 'rolling stone' impacted your personal growth or career path?",
      "If you could design your ideal lifestyle balancing movement and stability, what would it look like? Describe how you'd integrate both adventure and meaningful connections into your life."
    ]
  },
  "Session 2: The Curious Case of Cancel Culture 🤔": {
    "context": "Cancel culture has become a hot topic in recent years, evolving significantly with the rise of social media. While public shaming and ostracism have historical roots dating back to ancient civilizations, today's digital platforms amplify these practices dramatically, allowing anyone to initiate or participate in cancel campaigns instantly. Understanding the psychological factors behind cancel culture—such as group dynamics, cognitive dissonance, and schadenfreude—can help us better grasp why society engages in this phenomenon. Let's explore the psychology behind cancel culture, its evolution through history, and how it impacts our interactions and perceptions today.",
    "questions": [
      "Have you ever witnessed or participated in an online 'canceling' event? If so, what was your reaction or feeling at that moment?",
      "From your observations, do you think social media has made cancel culture more intense or widespread? Share any examples you've noticed.",
      "Some argue cancel culture is necessary for accountability, while others see it as overly harsh or unfair. What's your perspective on this balance between accountability and potential harm?",
      "Why do you think people sometimes enjoy seeing influential figures face public downfall? Do you believe concepts like 'schadenfreude' (pleasure from others' misfortune) play a significant role here?",
      "If you could redesign how society holds individuals accountable for their actions publicly, what approach would you propose to make it fairer and more constructive?"
    ]
  },
  "Session 3: YouTube Nation: Korea's New Media Obsession 📺": {
    "context": "South Koreans now spend an average of two hours daily watching YouTube, highlighting a significant shift in media consumption away from traditional TV toward online platforms. Young adults, especially those in their 20s and 30s, are leading this trend, drawn by the convenience, personalization, and diverse content available on YouTube. Popular content includes music videos, mukbang, ASMR, and relatable everyday life vlogs. Let's explore how YouTube has reshaped our media habits and why it resonates so strongly with us.",
    "questions": [
      "How much time do you typically spend watching YouTube each day? What kind of videos do you usually enjoy?",
      "Have you noticed any changes in your own or others' media consumption habits over the past few years? Share your observations or experiences.",
      "What do you think makes YouTube more appealing to Koreans compared to traditional media like TV or newspapers?",
      "How do you think the rise of personalized content and algorithms on platforms like YouTube affects our perspectives and opinions?",
      "Imagine you're creating your own YouTube channel—what type of content would you produce to engage Korean viewers in their 20s and 30s?"
    ]
  }
}