{
  "Session 1: Too Much of a Good Thing 🌟": {
    "context": "The saying 'Too much of a good thing can be bad' reminds us that even the most enjoyable or beneficial aspects of life can turn negative if taken to excess. From overeating favorite foods to overworking or even being overly happy, this concept applies to many areas of life. While some may see this as a call for moderation, others might question whether it's possible to truly have 'too much' of something positive. Let’s explore this idea together and share our thoughts and experiences.",
    "questions": [
      "Have you ever heard the phrase 'too much of a good thing'? What does it mean to you?",
      "Can you share an example from your life where something you enjoyed or valued became overwhelming or harmful because there was too much of it?",
      "Do you agree that moderation is key in life, or do you think some things are exceptions to this rule? Why?",
      "Why do you think people sometimes struggle to recognize when they've had 'too much' of something good? How can we find balance?",
      "If you could choose one thing in your life that you'd never grow tired of, no matter how much of it you had, what would it be? Why?"
    ]
  },
  "Session 2: Valentine's Day and Its Many Faces 🌹": {
    "context": "Valentine's Day is celebrated differently across cultures, with unique traditions that reflect local values and customs. In Korea, the holiday has evolved into a series of celebrations, including White Day and Black Day, offering something for everyone—couples and singles alike. While some see these holidays as romantic and fun, others view them as overly commercialized. Let’s explore how these traditions shape our experiences and perspectives on love, relationships, and even singlehood.",
    "questions": [
      "What are your thoughts on Valentine’s Day? Do you see it as a meaningful celebration or just a commercial holiday?",
      "Have you ever participated in Valentine’s Day or similar celebrations like White Day or Black Day? What was your experience like?",
      "In Korea, there are love-themed holidays every month on the 14th. What do you think about having so many occasions to celebrate love?",
      "How do you feel about the idea of Black Day for singles? Do you think it’s empowering or does it reinforce negative stereotypes about being single?",
      "If you could create a new holiday related to love or friendship, what would it be like? What traditions would you include?"
    ]
  },
  "Session 3: The Many Faces of You: Exploring Multiple Personas 🌟": {
    "context": "Have you ever noticed how you act differently at work, home, or with friends? This isn't unusual—many people adopt different personas depending on the situation. Some see this as a natural and necessary part of life, while others worry it might lead to losing touch with their authentic self. Let’s explore the idea of multiple personas, why they exist, and whether they help or hinder us in navigating our lives.",
    "questions": [
      "When do you notice yourself acting differently depending on the situation? (For example, at work versus at home.)",
      "Do you think having different personas for different roles or environments is helpful or harmful? Why?",
      "Have you ever felt like one of your personas doesn’t reflect your true self? How did that make you feel?",
      "Why do you think people naturally adapt their behavior in different social settings? Is it a survival skill or something else?",
      "If you could combine all your personas into one 'true self,' what would that look like? Would it be freeing or challenging?"
    ]
  }
}