{
  "1: Exploring Our Emotions 🌥️": {
    "questions": [
      "How would you describe your emotional personality? Are you generally more expressive or reserved with your feelings?",
      "What kinds of emotions do you usually feel throughout a typical day? How do you deal with them?",
      "Do you find it easy or difficult to express your emotions to others? Why do you think that is?",
      "Are there certain emotions you tend to hide or suppress? How does that affect you in the long run?",
      "How do you usually react when you feel overwhelmed by emotions? Do you have any strategies to calm yourself down?",
      "Have you ever felt like you were 'too emotional' in a situation? How did you handle it?",
      "What role do emotions play in making decisions for you? Do you tend to rely more on feelings or logic?",
      "How important do you think it is to have a healthy relationship with your emotions? What steps do you take to maintain that balance?",
      "How do you feel about crying? Is it something you find easy or difficult to do?",
      "Do you believe it’s possible to control your emotions completely, or do you think some emotions are just too strong to manage?"
    ]
  },
  "2: Exploring Life's Fun Dilemmas! 🌟": {
    "questions": [
      "Would you rather be able to learn any new skill instantly or travel anywhere in the world for free? How would you use this new ability in your life?",
      "What if you could live in any city in the world for a year, expenses covered? Where would you go, and how would you make the most of your time there?",
      "Debate: Is it better to spend money on experiences (like travel or concerts) or on physical items (like gadgets or fashion)? How do these choices shape our lives?",
      "Would you rather have a rewind button or a pause button for moments in your life? How would you use this ability to shape your experiences?",
      "What if you had to choose between living in a country with amazing food but no entertainment options, or a country with incredible entertainment but only basic food? Which would you prefer, and why?",
      "Debate: Is it more meaningful to have a large circle of acquaintances or a small group of close friends? How do different types of relationships impact your happiness?",
      "Would you rather always be the smartest person in the room or the funniest? How do intelligence and humor influence social interactions?",
      "What if you could only keep one form of entertainment for the rest of your life: books, movies, music, or games? Which would you choose, and how would it shape your daily routine?",
      "Debate: Which has a bigger impact on shaping who you are: the people you meet or the places you go? Can one exist meaningfully without the other?",
      "Would you rather never have to sleep or never have to eat again? What would you do with the extra time, and how would it change your lifestyle?"
    ]
  }
}