{
  "Session 2: Consistency vs. Intensity: Which One Fuels Your Life? 🔥🧘‍♂️": {
    "context": "When working toward our goals—whether in fitness, relationships, career, or self-development—we often choose between two approaches: intense bursts of effort or consistent, gradual progress. While Korean culture often uplifts passion and quick success, many are reconsidering the power of patience and persistence. This session explores how both consistency and intensity shape our lives, and which one truly drives meaningful change.",
    "questions": [
      "Are you more of a 'slow and steady' type or an 'all-in, full-intensity' type when it comes to personal goals? Why do you think that is?",
      "Have you ever tried something with intense passion—like a 30-day challenge or an all-night project? How did it go, and what did you learn from it?",
      "In your opinion, what makes consistent effort so hard to maintain, even when we know it’s good for us?",
      "Korean society often praises 열정 (passion) and 빠른 결과 (fast results). Do you think this helps or hurts people in the long run? What alternatives could work better?",
      "If you could redesign your lifestyle to balance intensity and consistency perfectly, what would that look like? What habits or mindset would you change starting tomorrow?"
    ]
  },
  "Session 3: Country of Origin: What's in a Label? 🌏": {
    "context": "Labels like 'Made in Korea' or 'Designed in California' do more than state origin—they shape our perceptions of value, identity, and cultural pride. In a world where both products and people are influenced by global forces, this session reflects on how origin stories affect our sense of self, consumer choices, and how we define authenticity and belonging.",
    "questions": [
      "When you buy something new, how much attention do you pay to where it was made or designed? Do you ever feel more confident or hesitant because of a label?",
      "Are there any products, brands, or cultural exports from your country or culture that you're especially proud of? Why do you like them, and what do you think they say about where you're from?",
      "If you were labeled like a global product, what would your 'identity tags' say? Feel free to choose your own words—like 'Made in ___', 'Educated in ___', 'Influenced by ___', 'Inspired by ___', or even 'Tested in ___'. What moments, places, or people have shaped who you are?",
      "Do you think a product’s country of origin still matters as much today, or are we moving toward a more global, blended idea of quality and identity? Why do you think some labels carry more weight than others?",
      "What do you think are the pros and cons of having strong 'national branding,' like K-beauty or K-pop? Can a country be misunderstood or limited by its own popular image?"
    ]
  }
}