{
  "Session 2: Are Our Desires Really Ours? 🧠✨": {
    "context": "Philosopher René Girard proposed that many of our desires are 'mimetic'—influenced by watching others rather than arising independently. This session invites us to reflect on how social pressures, rivalry, and cultural trends shape what we want, and how we can better recognize and connect with our true desires.",
    "questions": [
      "Looking back, can you think of a time when you started wanting something only after seeing others want it? (It could be about fashion, gadgets, career goals, or even a lifestyle.)",
      "Have you ever found yourself competing with someone — maybe even unconsciously — for something you both wanted? (What was it like emotionally? Did you realize it at the time, or only later?)",
      "In your opinion, how does social media amplify mimetic desire today? (Is there anything you personally feel pressured to want or do because of what you see online?)",
      "How do you personally tell the difference between a desire that's truly yours and a desire you might have picked up from others? (Is it easy to tell? What signs do you look for?)",
      "If you could erase all outside influence for one day and listen only to yourself, what do you think you would genuinely want most? (It could be anything — a place to go, a project to start, a lifestyle change.)"
    ]
  },
  "Session 3: How Snacks Tell Our Story 🍿": {
    "context": "Snacks are more than just food—they are carriers of memory, culture, and personal identity. This session uses the playful and nostalgic world of snacks to dive into how our favorite treats connect us to our past, represent who we are, and allow us to share our culture with others.",
    "questions": [
      "What is one snack you loved as a child that you still crave sometimes? (Follow-up: How did you first discover it?)",
      "Have you ever introduced a favorite snack to someone from another culture? (What was their reaction?) Or, have you ever come across a snack from another culture yourself? What was your first impression?",
      "If you could create a snack that represents your personality, what would it taste like or look like? (Sweet, salty, spicy, crunchy? Tell us!)",
      "Some people say snacks in Korea reflect creativity and fun. Do you agree? (How would you describe Korean snack culture compared to other countries you've visited or lived in?)",
      "Imagine you could gift a snack to your childhood self—something you didn't know about back then. What would you choose, and why? (Would it be something comforting, exciting, surprising?)"
    ]
  }
}