{
  "Session 1: Too Much of a Good Thing 🌟": {
    "context": "The saying 'Too much of a good thing can be bad' reminds us that even the most enjoyable or beneficial aspects of life can turn negative if taken to excess. From overeating favorite foods to overworking or even being overly happy, this concept applies to many areas of life. While some may see this as a call for moderation, others might question whether it's possible to truly have 'too much' of something positive. Let’s explore this idea together and share our thoughts and experiences.",
    "questions": [
      "Have you ever heard the phrase 'too much of a good thing'? What does it mean to you?",
      "Can you share an example from your life where something you enjoyed or valued became overwhelming or harmful because there was too much of it?",
      "Do you agree that moderation is key in life, or do you think some things are exceptions to this rule? Why?",
      "Why do you think people sometimes struggle to recognize when they've had 'too much' of something good? How can we find balance?",
      "If you could choose one thing in your life that you'd never grow tired of, no matter how much of it you had, what would it be? Why?"
    ]
  },
  "Session 2: Advice to Your Younger Self 🌟": {
    "context": "Reflecting on advice to your younger self can be a deeply personal and meaningful exercise. It allows us to revisit our past experiences, identify lessons learned, and appreciate how far we’ve come. This session invites you to share insights, regrets, and wisdom you wish you had known earlier in life. By discussing this, we can connect over shared experiences and inspire each other to embrace growth and self-compassion.",
    "questions": [
      "If you could go back in time, what is one piece of advice you would give your younger self? Why does this feel important now?",
      "What is something you used to worry about a lot when you were younger that seems less significant now? How has your perspective changed?",
      "Is there a specific moment or decision in your past where you wish you had acted differently? What would you do instead if given the chance?",
      "Reflecting on your journey, what’s one lesson you’ve learned that you think everyone should know? How did this lesson shape who you are today?",
      "Imagine writing a letter to your younger self—what would the opening line be, and what emotions or thoughts would you want to convey?"
    ]
  },
  "Session 3: The Many Faces of You: Exploring Multiple Personas 🌟": {
    "context": "Have you ever noticed how you act differently at work, home, or with friends? This isn't unusual—many people adopt different personas depending on the situation. Some see this as a natural and necessary part of life, while others worry it might lead to losing touch with their authentic self. Let’s explore the idea of multiple personas, why they exist, and whether they help or hinder us in navigating our lives.",
    "questions": [
      "When do you notice yourself acting differently depending on the situation? (For example, at work versus at home.)",
      "Do you think having different personas for different roles or environments is helpful or harmful? Why?",
      "Have you ever felt like one of your personas doesn’t reflect your true self? How did that make you feel?",
      "Why do you think people naturally adapt their behavior in different social settings? Is it a survival skill or something else?",
      "If you could combine all your personas into one 'true self,' what would that look like? Would it be freeing or challenging?"
    ]
  }
}