{
  "Session 1: Lies 🤥": {
    "questions": [
      "Do you think lying is ever justified? If so, in what situations?",
      "Have you ever told a lie to protect someone's feelings? How did it turn out?",
      "How do you feel about 'white lies'? Are they harmless or potentially harmful?",
      "Have you ever been caught in a lie? How did you handle the situation?",
      "Do you think honesty is always the best policy, or are there exceptions?",
      "Have you ever experienced a situation where a lie snowballed into something bigger? What happened?",
      "How do you think lying affects relationships, whether romantic, professional, or friendships?",
      "Have you ever told a lie that you later regretted? What did you learn from it?",
      "How do you usually react when you find out someone has lied to you?",
      "Is there a difference between lying and withholding the truth? How do you view this distinction?"
    ]
  },
  "Session 2: Balance Game (Work) 💼": {
    "questions": [
      "Would you rather work with someone who smells bad or someone who is extremely loud?",
      "Do you prefer creative work or analytical work? Why?",
      "Would you rather work from home full-time or work in the office full-time?",
      "Would you prefer dealing with an angry client or an angry boss?",
      "Would you rather have a job where you never travel or a job where you travel frequently?",
      "Would you choose to get paid well for a super boring job or get paid an average salary for a super interesting job?",
      "Do you prefer having lots of instructions or lots of freedom in your work?",
      "Would you rather be friends with everyone at work or have a few close friends in the office?",
      "Would you choose the ability to fast forward time or the ability to pause time at work?",
      "Do you prefer a quiet workplace or an energetic workplace? Why?"
    ]
  },
  "Session 3: Maturity 🌱": {
    "questions": [
      "What do you think are the key signs of maturity? Can you give examples from your life or someone you know?",
      "How do you balance your emotions with making logical decisions? Is it easy for you to keep your feelings in check?",
      "In your opinion, how important is patience in showing maturity? Can you share a time when patience paid off?",
      "How do you ensure you keep long-term commitments or promises, even when motivation fades?",
      "Do you think being a good listener is a sign of maturity? How do you practice active listening?",
      "How do you handle situations where you realize you've made a mistake? Do you find it easy to admit when you're wrong?",
      "What role does humility play in being mature? Can you think of a situation where humility was important?",
      "How open-minded are you when it comes to opinions that differ from yours? How do you approach such situations?",
      "How self-aware do you consider yourself? What strategies do you use to assess your feelings and actions?",
      "Do you believe maturity is more related to age or experience? Why?"
    ]
  }
}
