{
  "Session 1: The Paradox of Generosity in a Busy World 🌊": {
    "context": "This session explores the contradiction between the desire to be generous and the fast-paced, busy lifestyles that often prevent people from acting on that desire. It draws on insights like the Good Samaritan Experiment to highlight how external factors like time pressure, rather than internal traits, often dictate our willingness to help.",
    "questions": [
      "Think of a time when you were rushing somewhere important but still stopped to help someone – what was going through your mind? Was it worth the delay?",
      "Have you ever caught yourself using 'I'm too busy' as an excuse to avoid helping someone, then felt guilty about it later? What happened?",
      "If your friends secretly rated your generosity on a scale of 1-10, what score would they give you, and would that score change depending on how busy you are?",
      "Imagine you won the lottery and suddenly had all the time and money in the world – how would your acts of kindness change? Would you become the neighborhood hero or still guard your resources?",
      "What's your go-to 'quick act of kindness' that fits into even your busiest days? Have you discovered any sneaky ways to be generous that don't require much time?"
    ]
  },
  "Session 2: The Honeymoon Effect: From Euphoria to Everyday Reality 🌟": {
    "context": "This session examines the psychological phenomenon known as the Honeymoon Effect, often experienced during the early stages of relationships, jobs, or travel. It delves into how this euphoric phase gives way to a more grounded reality and explores whether it’s possible to sustain or rekindle that initial excitement.",
    "questions": [
      "Can you recall a time when you experienced the Honeymoon Effect in your life—perhaps in a relationship, new job, or when traveling to a new country? How did that initial period of excitement feel?",
      "When traveling to new places, have you noticed your perception changing over time? How was your experience different between the first few days and later in your stay?",
      "What strategies have you used (or could you use) to maintain enthusiasm after the initial excitement fades, whether in relationships, new jobs, or travel experiences?",
      "Some people argue that moving beyond the Honeymoon phase leads to deeper, more authentic experiences. Do you agree? Can you share an example where getting past the initial excitement led to a more meaningful connection with a place, person, or activity?",
      "How do you think cultural differences affect the Honeymoon Effect when traveling or living abroad? Have you experienced or witnessed the transition from honeymoon phase to culture shock?"
    ]
  },
  "Session 3: The Private Education Boom in South Korea 🎓": {
    "context": "This session looks into South Korea’s increasing private education spending despite a shrinking student population. It raises questions about societal pressure, parental sacrifice, and the broader implications of a hyper-competitive academic environment.",
    "questions": [
      "What's your most memorable (or traumatic!) hagwon experience? Any funny stories or unforgettable teachers from your private education days?",
      "If you had to choose between sending your future child to five hagwons or taking them on five international trips with the same budget, which would you pick and why?",
      "Have you ever experienced 'relative deprivation' - that feeling when you compare your academic achievements to others and feel inadequate? How did you handle it?",
      "If you could design your own ideal hagwon that would actually be fun to attend, what would it teach and how would it operate? Get creative!",
      "Looking back, was there a moment when you realized your parents were making significant financial sacrifices for your education? How did that affect you?"
    ]
  }
}