{
  "Session 1: Better to Bend or Break? Finding Balance in Life 🌳": {
    "context": "The proverb 'Better to bend than to break' highlights the value of flexibility and adaptability, suggesting that sometimes compromising or adjusting our approach can help us overcome challenges without losing what matters most. For instance, in the workplace, being open to new ideas or unexpected changes can lead to growth and innovation, while excessive rigidity might result in missed opportunities or conflicts. However, there are also situations—like standing firm on personal values or ethical principles—where bending might not be an option. Today, let's share our experiences and perspectives to explore how we navigate these choices between flexibility and firmness.",
    "questions": [
      "Think of a recent situation—perhaps at work, school, or in a relationship—where you decided to 'bend' rather than stand firm. What motivated your decision, and were you satisfied with the outcome?",
      "Have you ever witnessed someone being too rigid or inflexible in a crisis or challenging situation? What happened as a result?",
      "In your opinion, what are some clear examples of situations where it's better to stand firm rather than compromise? (e.g., ethical dilemmas, personal boundaries)",
      "Reflecting on your life experiences, how do you personally gauge when flexibility is wise versus when it might lead to losing sight of your goals or values?",
      "Imagine you're mentoring someone younger who struggles with balancing flexibility and firmness—for example, dealing with workplace politics or maintaining healthy relationships. What practical advice would you offer them?"
    ]
  },
  "Session 2: Facing Fear: Building Courage and Resilience 🌟": {
    "context": "Fear is a natural emotion that everyone encounters, whether it's trying something new, facing uncertainty, or recovering from setbacks. Often, having someone supportive by your side can make a significant difference in overcoming hesitation and building confidence. Through encouragement, patience, and positive reinforcement, we can transform fear into personal growth and resilience. Today, let's share our experiences and insights on how we've confronted fears, supported others in challenging moments, and emerged stronger from these experiences.",
    "questions": [
      "Can you recall a fear you had when you were younger? How did you eventually overcome it?",
      "Share a time when someone's support or encouragement helped you face a challenging or scary situation. How did their presence make a difference?",
      "In your opinion, what's the most effective way to help someone who feels afraid—should we gently encourage them or let them decide entirely on their own?",
      "Reflecting on your own experiences, do you think it's always beneficial to confront fears directly, or are there situations where avoiding them might be wiser? Why?",
      "Imagine yourself as a parent or mentor: how would you guide someone younger through their fears? Share some creative strategies or approaches you'd use to build their courage."
    ]
  },
  "Session 3: Stanning (덕질): Passion or Obsession? 🌟": {
    "context": "The term *stan* originated from Eminem's 2000 song 'Stan,' which tells the story of an overly devoted fan whose obsession leads to tragic consequences. Over time, the word has evolved to describe intense enthusiasm or dedication—not just for celebrities, but also for hobbies and interests. Stanning can be a source of joy and connection, fostering creativity and community. However, it also has a darker side when passion turns into unhealthy obsession or toxic behavior. Whether you’ve passionately followed a favorite artist, immersed yourself in a hobby, or observed stanning culture online or among friends, it’s something many of us can relate to. Let’s explore its impact on our lives and share stories about what we love—and what we’ve seen.",
    "questions": [
      "Have you ever 'stanned' something (or someone) yourself? If not, have you observed others doing so? What stood out to you?",
      "What are some fandoms or communities you’ve been part of—or noticed others joining? What do you think makes these groups so appealing?",
      "In your opinion, what are the positive aspects of stanning? Have you seen examples where it helped people connect, grow, or express themselves?",
      "Have you ever noticed stanning go too far—either in your own experience or through things like social media? What do you think causes this shift from passion to obsession?",
      "If you could create a fandom for something unique (like an underrated hobby or idea), what would it be about? How would you make it fun and inclusive for others?"
    ]
  }
}