{
  "Session 1: Is the Grass Really Greener? 🌱": {
    "context": "Have you ever felt that others seem to have it better, only to realize later that their lives come with their own set of struggles? The proverb 'The grass is always greener on the other side' captures our tendency to idealize what we don't have, whether it's a prestigious university, a dream job, a luxury car, or even a perfect soulmate. Yet, once we reach these seemingly perfect situations, we often discover they're just new challenges in disguise. Today, let's explore our experiences and reflections on this universal phenomenon.",
    "questions": [
      "Can you recall a time when you thought achieving something would make your life easier or happier? What was it, and how did reality compare to your expectations?",
      "Have you ever envied someone else's lifestyle or situation, only to discover later that it wasn't as perfect as you imagined? Share your experience.",
      "Why do you think people often perceive other situations as better than their own? Is it human nature, societal pressure, or something else?",
      "How can constantly comparing ourselves to others affect our mental health and overall happiness? Have you experienced this personally?",
      "What strategies or mindset shifts can help us appreciate our current situations more fully instead of always looking for greener grass elsewhere?"
    ]
  },
  "Session 2: Speed Dating in Korea: Love in 10 Minutes? 💘": {
    "context": "Speed dating has become a popular trend in Korea, especially among young adults who value efficiency and convenience in finding a partner. With participants rotating through multiple short conversations in one event, speed dating offers a unique opportunity to meet many people in a short time. However, opinions are divided—some praise its practicality, while others question whether meaningful connections can truly form in just 10 minutes. Let’s explore this fascinating dating trend and share our thoughts, experiences, and perspectives!",
    "questions": [
      "Have you ever participated in or considered joining a speed dating event? What do you think the experience would be like?",
      "Why do you think speed dating has become so popular in Korea recently? Do you see it as an effective way to meet new people?",
      "Some people say that speed dating feels too rushed or superficial. Do you agree with this perspective? Why or why not?",
      "What do you think are the advantages and disadvantages of speed dating compared to traditional blind dates or dating apps?",
      "If you were to design your ideal speed dating event, what would it look like? What changes would you make to encourage deeper connections?"
    ]
  },
  "Session 3: Foodie Finds: Discovering Korea's Hidden Gems 🍽️": {
    "context": "Michelin recently released its 2025 Bib Gourmand list, highlighting budget-friendly gourmet restaurants in Seoul and Busan. While guides like Michelin offer reliable recommendations, many food enthusiasts prefer alternative ways to discover hidden gems. From apps like MangoPlate and WAUG to word-of-mouth recommendations and spontaneous explorations, there are numerous approaches to finding delicious eats in Korea. Let's explore how you discover your favorite dining spots and share memorable culinary experiences!",
    "questions": [
      "Have you ever visited a restaurant recommended by the Michelin Guide or similar lists? How was your experience?",
      "What's your go-to method for finding good restaurants or hidden gems in Korea? Share a memorable discovery you've made.",
      "Do you trust online reviews (like those on Naver, Kakao Map, or Instagram) when choosing where to eat? Why or why not?",
      "Some people say popular restaurants with long waiting lines aren't always worth the hype. What's your opinion on this?",
      "Imagine you're creating your own restaurant guide—what unique criteria or personal touches would you include to help others find truly special dining experiences?"
    ]
  }
}