{
  "Sat. 1: Farewell / Letting Go 👋": {
    "questions": [
      "Have you ever had to say goodbye to something or someone important in your life? How did you cope with it?",
      "What are some things or people that were hardest for you to let go of? Why were they so significant to you?",
      "How do you usually handle farewells with friends or loved ones when you move to a new place or start a new chapter in life?",
      "Have you ever had to say goodbye to a beloved pet? How did that experience affect you?",
      "What is the most memorable farewell you've experienced, and why did it leave such a lasting impact?",
      "How do you deal with letting go of material items that hold sentimental value? Do you find it difficult to throw things away?",
      "How do you feel about saying goodbye to a job or career path? Have you ever had to make a difficult career transition?",
      "How do you navigate the emotional process of leaving a place that has been important to you, like your childhood home or a city you’ve lived in for a long time?",
      "In your opinion, is it harder to say goodbye to people or places? Why?",
      "How do you find closure after saying goodbye? What helps you move forward?"
    ]
  },
  "Sat. 2: Crushes 💕": {
    "questions": [
      "Do you remember your first crush? What was it like, and how did you handle those feelings?",
      "What typically causes you to develop a crush on someone? Is it their personality, looks, or something else?",
      "How do you act around someone you have a crush on? Do you find it easy or difficult to be yourself?",
      "Have you ever had a secret crush on someone? How did you keep it hidden, or did you eventually reveal your feelings?",
      "How do you usually react when you find out that someone has a crush on you? Has this ever led to a relationship?",
      "What’s the most awkward or funny thing you’ve done because of a crush?",
      "Have you ever confessed your feelings to a crush? How did it go, and what did you learn from the experience?",
      "What’s the difference between having a crush and being in love, in your opinion? Have you experienced both?",
      "Have you ever had a crush that didn’t live up to your expectations once you got to know the person better? How did that change your perspective?",
      "How do you handle the emotions of a crush that doesn’t work out? Do you have any strategies for moving on?"
    ]
  },
  "Sat. 3: Reverse Migration 🌍": {
    "questions": [
      "What are some reasons people choose to migrate to other countries? Have you ever considered moving abroad yourself?",
      "Have you noticed any trends of people moving back to Korea after living abroad? What do you think drives this decision?",
      "How do you think the cost of living and safety compare between Korea and other countries? Would these factors influence your decision to move?",
      "What role do family ties and a sense of belonging play in the decision to return to one’s homeland? Have you ever felt this pull?",
      "How do you think Korea’s infrastructure and healthcare system compare to other countries? Do you think these factors attract people back to Korea?",
      "Have you or someone you know ever returned to Korea after living abroad? What were the reasons, and how was the transition?",
      "How do you think the experience of living abroad changes one's perspective on life in Korea? Do you think it makes people appreciate or critique their homeland more?",
      "What challenges do you think people face when they move back to Korea after years of living abroad? How can they overcome these challenges?",
      "How do you view the government's policies on dual nationality and pensions for returnees? Do you think they are fair and effective?",
      "Do you think reverse migration is a growing trend that will continue in the future? Why or why not?"
    ]
  },
  "Thu. 1: First Impression 👥": {
    "questions": [
      "What kind of first impression do you think you leave on others? How do you feel about it?",
      "What kind of first impression do others tell you that you have? Is it different from what you expected?",
      "Feel free to take turns sharing your first impressions of each other. Then, share whether or not you think these impressions are accurate.",
      "How important is making a first impression? What kind of lasting effects can a first impression have?",
      "It's widely known that your first impression of someone is determined within the first few seconds of meeting them. How do you feel about this idea?",
      "What factors do you think play the largest role in forming someone's first impression of you?",
      "How accurate do you think your first impression of someone usually is? Have you ever been surprised by how someone turned out?",
      "Have there been instances in which someone's first impression was completely different from who they were after you got to know them?",
      "How do you approach making a good first impression in professional settings compared to social ones?",
      "Share a memorable first impression story. What made it stand out to you, and did your impression change over time?"
    ]
  },
  "Thu. 2: Opinions and Perspectives 🌍": {
    "questions": [
      "Do you think it's better to follow your passion or choose a career that offers stability? Why?",
      "How important do you think it is to learn about other cultures? What benefits does cultural awareness bring to society?",
      "What do you think is the biggest challenge facing young people today? How do you think they can overcome it?",
      "If you had the power to solve one global issue, what would it be, and how would you approach it?",
      "How do you personally define success in life? Has your definition changed over time?",
      "In your opinion, which has a greater impact on society: art or music? Why do you think so?",
      "Should people be allowed to work from home permanently, or is it better to work in an office? What are the pros and cons of each?",
      "How do you feel about the idea of a universal basic income? What effects do you think it would have on society?",
      "What role do you think schools should play in teaching life skills, such as managing finances or mental health? How could this be implemented effectively?",
      "Do you believe that climate change is the most urgent issue of our time? Why or why not?"
    ]
  }
}

