{
  "1: Childhood Memories 🌟": {
    "questions": [
      "How did you spend your free time as a child? What hobbies or activities were you passionate about?",
      "What kind of student were you in school? Were you more of a studious type, or did you prefer having fun?",
      "What was your favorite subject or class in school, and why did you enjoy it?",
      "Did you participate in any clubs or extracurricular activities? What were they, and what did you enjoy about them?",
      "Do you remember having a childhood crush? How did you feel, and did you ever confess your feelings?",
      "Can you share a memorable experience from a school festival or event? What made it special?",
      "What friendships from your childhood stand out the most to you, and why were they important?",
      "What did you dream of becoming when you were a child? How did those dreams change as you grew older?",
      "What were some of your favorite songs or TV shows growing up? Do you still listen to or watch any of them?",
      "Did you have a favorite game or way to play with friends? What do you remember most about those times?"
    ]
  },
  "2: Giving and Receiving Advice 💡": {
    "questions": [
      "How often do you seek advice, and in what situations? Who do you usually turn to for guidance?",
      "Can you recall a specific piece of advice that made a lasting impact on your life? Why did it resonate with you?",
      "Have you ever received advice that you found unhelpful or even harmful? What do you think the person's intentions were, and how did you handle it?",
      "Do people frequently come to you for advice? What types of situations do they seek your opinion on?",
      "Do you enjoy giving advice to others? What do you find most challenging or rewarding about it?",
      "What is a piece of advice you've given to someone that you feel really helped them? How did you come up with it?",
      "In your opinion, what are the qualities of good advice? How can you tell if advice is worth following?",
      "Do you think it's harder to give advice or to receive it? Why do you feel this way?",
      "Let's role-play! What advice would you give to someone facing one of these situations:\n- A. Someone starting their first job\n- B. Someone considering changing jobs\n- C. Someone thinking of giving up on a long-term goal\n- D. Someone feeling lost in their career\n- E. Someone losing confidence in themselves\n- F. Someone wondering whether they should ask their crush out",
      "How do you handle advice that you disagree with? Do you find it easy to reject advice, or do you feel pressured to follow it?"
    ]
  },
  "3: Texting and Relationships 📱💬": {
    "questions": [
      "How often do you text someone you're in a romantic relationship with? Do you think the amount of texting reflects the closeness of the relationship?",
      "Do you have a preferred frequency of texting with your partner? How does it make you feel if it's more or less than that?",
      "How do you handle inconsistency in texting from a romantic partner? Does it make you feel uncertain or do you not mind it?",
      "Do you think texting too much or too little can affect the health of a relationship? Why or why not?",
      "How quickly do you typically respond to texts from romantic partners, friends, family, or work colleagues? Do you think different relationships require different response times?",
      "Have you ever experienced a situation where someone's texting style or frequency made you feel closer to or more distant from them? How did you navigate that?",
      "What are your thoughts on the scarcity of communication in a relationship? Can less frequent texting sometimes be a sign of a problem, or is it just a matter of personal preference?",
      "How do you feel when someone you care about takes a long time to reply? Does it change depending on the person or context?",
      "Do you believe the way we text can sometimes create misunderstandings in romantic relationships? What can be done to avoid that?",
      "What's your strategy when you need space but don't want to hurt someone by not texting them as much? How do you communicate your need for personal time?"
    ]
  }
}