{
  "Session 2: Easy Come, Easy Go? 💸": {
    "context": "This session dives into the emotional and psychological value we place on things we gain with or without effort. It explores the difference between things that come easily and those we work hard for, and how that affects our appreciation, mindset, and priorities.",
    "questions": [
      "Can you think of something you got easily in life—but lost or gave up just as easily? This could be money, a relationship, an opportunity, or even a friendship.",
      "Have you ever worked really hard for something? How did that affect how much you valued it?",
      "Do you think younger generations—including us—value things less because of how fast we get them, like money from side gigs, instant dates from apps, or short-term jobs? Why do you think this happens—or do you disagree?",
      "Is there something in your life right now that you’re trying to hold onto—but feel it might slip away? Be as open or as light as you like—this could be a job, a routine, a feeling, or even a mindset.",
      "If everything in life came easily, what do you think we’d miss out on emotionally or mentally? Would things still feel meaningful?"
    ]
  },
  "Session 3: The Cost of Convenience: Korea’s Food Delivery Boom 🍟": {
    "context": "In Korea, food delivery apps like Baemin and Coupang Eats have evolved from rare luxuries to daily essentials. This session examines how hyper-convenient services are affecting consumer habits, local businesses, delivery workers, and societal expectations. It questions whether the pursuit of speed and ease comes at too high a price.",
    "questions": [
      "How often do you use food delivery apps, and what kind of situations usually make you order? Late-night cravings, rainy days, work stress, hangouts?",
      "Have you ever felt surprised—or maybe a little guilty—about how much you spent or how often you ordered delivery in a week or month? What was going through your mind at that time?",
      "What do you think about the competition between Baemin, Coupang Eats, and Yogiyo? Is it good for consumers, or is it creating bigger problems?",
      "In your opinion, has food delivery made life better—or just busier and more dependent on instant results? How do you feel when you compare cooking at home vs. ordering in?",
      "If you could redesign the future of food delivery in Korea, what would you keep, change, or remove? Would you want drone deliveries, slower but fairer systems, or something totally new?"
    ]
  }
}