{
  "Session 1: Your Vibe Attracts Your Tribe 😊": {
    "context": "The saying 'Your vibe attracts your tribe' suggests that the energy or attitude you project influences the kind of people you attract into your life. This concept emphasizes the importance of self-awareness and authenticity in building meaningful relationships. In this session, let's delve into how our personal vibes shape our social circles, share experiences of connections formed through shared energies, and discuss ways to cultivate the kind of 'tribe' we desire.",
    "questions": [
      "How would you describe the 'vibe' you typically project in social settings? Do you think it accurately reflects your true self?",
      "Can you share an experience where you felt a strong connection with someone due to similar energies or attitudes? What impact did this have on your relationship?",
      "Do you agree with the idea that 'like attracts like' when it comes to personal relationships? Why or why not?",
      "Have you ever noticed a change in your social circle when you've made a conscious effort to alter your attitude or outlook on life? What was that experience like?",
      "What steps can you take to ensure that the energy you emit aligns with the type of people you wish to attract into your life?"
    ]
  },
  "Session 2: Battling Burnout: Navigating Work-Life Balance in Korea 🇰🇷": {
    "context": "In Korea, the demanding work culture often leads to extended working hours, yet productivity levels remain relatively low. This imbalance contributes to widespread burnout among professionals. A survey revealed that 70% of Korean office workers experienced burnout over a one-year period. Understanding and addressing burnout is crucial for maintaining mental health and achieving a sustainable work-life balance.",
    "questions": [
      "What does the term 'burnout' mean to you, and have you ever felt it in your professional life?",
      "What factors in your workplace contribute most to stress and potential burnout?",
      "How do you personally manage stress to prevent burnout? Are there specific strategies or activities you find effective?",
      "In your opinion, what changes could organizations implement to reduce employee burnout?",
      "How can individuals and companies work together to create a healthier work environment that promotes well-being and productivity?"
    ]
  },
  "Session 3: What's in a Name? 🌟": {
    "context": "Names and nicknames often reflect the different chapters of our lives, showing how we’ve been seen by others and how we see ourselves. From childhood nicknames to online usernames, or even names adapted for different cultures, these labels can carry stories, emotions, and meanings. In this session, we’ll share our experiences with the names we’ve had, explore how they shaped us, and reflect on the connections they’ve created.",
    "questions": [
      "What are some of the names or nicknames you’ve had throughout your life? Who gave them to you?",
      "Have you ever chosen a name for yourself, like a nickname, online handle, or name for a new culture? How did you decide on it?",
      "Is there a name or nickname you really loved or disliked? Why did you feel that way about it?",
      "How do you think the names people call you affect the way you feel about yourself or how others see you?",
      "If you could pick a new name or nickname for yourself right now, what would it be and why?"
    ]
  }
}