{
  "Session 1: Breaking the Ice - The Art of Approaching Someone 💬": {
    "context": "Breaking the ice is the first step to making new friends. Let's share our ice-breaking stories.",
    "questions": [
      "Have you ever approached someone you were interested in? How did it go?",
      "What do you think makes a good 'first impression' when meeting someone new?",
      "How do cultural differences influence how people approach one another?",
      "Have you ever been approached by someone in a memorable or unusual way? What happened?",
      "What are some common fears or challenges people face when trying to 'break the ice'?",
      "Do you think people rely too much on social media or dating apps instead of face-to-face interactions? Why or why not?",
      "What are some good conversation starters you’ve used or heard of?",
      "How do you react when someone approaches you in public? Do you enjoy it or find it uncomfortable?",
      "What are your thoughts on the phrase 'love at first sight'? Is it realistic or just a romantic idea?",
      "Can you share a story about a time you approached someone, or someone approached you, that had an unexpected outcome?"
    ]
  },
  "Session 2: Animation and Comics 🎨": {
    "context": "Animation and comics are a great way to express creativity and imagination. Let's share our favorite animation and comic stories.",
    "questions": [
      "What is your earliest memory of watching an animated show or reading a comic? How did it make you feel?",
      "Do you have a favorite animated movie or comic book? What makes it special to you?",
      "How do you think animation and comics have changed over the years? Do you prefer older or newer styles?",
      "Are there any animated shows or comics that influenced your childhood? How did they shape your imagination or interests?",
      "What are some differences between animations or comics from different countries? Have you noticed unique cultural elements in them?",
      "Do you think animation and comics are only for children, or can they appeal to adults too? Why?",
      "Have you ever tried creating your own comic or animation? If not, what kind of story would you create if given the chance?",
      "How do animations and comics use visuals and storytelling to convey emotions or messages? Can you share an example that impressed you?",
      "What role do superheroes play in comics and animations? Do you have a favorite superhero or villain, and why?",
      "How do you think animations and comics will evolve in the future with advancements in technology like AI or virtual reality?"
    ]
  },
  "Session 3: Unlocking the Secrets of Muscle Memory 🏋️‍♂️": {
    "context": "Muscle memory is the ability of the body to remember how to perform a movement or skill without conscious thought. Let's share our muscle memory stories.",
    "questions": [
      "What is your understanding of muscle memory? Can you think of any examples from your daily life where you rely on it?",
      "Have you ever learned a skill that became automatic over time, like typing or playing an instrument? How did it feel when it became second nature?",
      "Muscle memory often requires repetition. What is something you’ve practiced repeatedly to master, and how did the process shape your experience?",
      "Have you ever experienced losing a skill after a long break but regaining it quickly? What do you think helped you recover it so fast?",
      "How does muscle memory differ from other types of memory, like remembering facts or events? Why do you think some skills are easier to retain than others?",
      "In what ways do you think muscle memory can be beneficial in sports or physical activities? Can you share any personal stories about this?",
      "Have you ever been surprised by your ability to perform a task without thinking about it? How does this relate to the concept of 'autopilot' in muscle memory?",
      "Do you believe mental visualization can help improve muscle memory? Have you tried this technique before, and what were the results?",
      "How do you think muscle memory might play a role in overcoming challenges, such as recovering from an injury or learning new habits?",
      "If you could develop muscle memory for any skill instantly, what would it be and why?"
    ]
  }
}
