{
  "Sat 1: Animals 🐾": {
    "questions": [
      "What are your favorite animals, and why do you love them? Have you ever had an encounter with them in real life?",
      "Have you had any pets? If so, tell us about them. If not, have you ever wanted a pet? What kind of pet would you have chosen?",
      "Have you ever had a funny or memorable experience with an animal? Share the story!",
      "Which animal do you think you resemble the most in terms of personality or appearance? Why?",
      "Did you have any animal-related obsessions as a child, like dinosaurs, insects, or horses? What fascinated you about them?",
      "Have you ever encountered a wild or exotic animal? How did you feel during that experience?",
      "What’s your opinion on zoos and aquariums? Do you think they play a positive role in conservation, or are they problematic?",
      "Are there any animal documentaries that you enjoy watching? What do you like about them?",
      "How do you feel about endangered species? Are there any particular animals you’re concerned about?",
      "If you could have any animal as a pet, no matter how wild or exotic, what would you choose and why?"
    ]
  },
  "Sat 2: Employee vs. Entrepreneur 💼🚀": {
    "questions": [
      "Do you think you’re more suited to being an employee or an entrepreneur? Why?",
      "What do you think are the biggest advantages of being an employee? How about the biggest advantages of being an entrepreneur?",
      "How do you feel about the stability of a traditional job compared to the risks of starting your own business?",
      "What personality traits do you think are essential for being a successful entrepreneur? How do these compare to traits needed for being a good employee?",
      "How important do you think work-life balance is in choosing between being an employee or an entrepreneur?",
      "Do you think the freedom and autonomy of being an entrepreneur outweigh the security of being an employee? Why or why not?",
      "What do you think are the biggest challenges that entrepreneurs face that employees do not?",
      "How do you think responsibilities differ between an employee and an entrepreneur? Which set of responsibilities do you find more appealing?",
      "Have you ever considered starting your own business, or do you know someone who has? What motivated that decision?",
      "In your opinion, is one path (employee or entrepreneur) better suited to certain stages of life, such as early career vs. later career?"
    ]
  },
  "Sat 3: Dopamine Fasting 🎯": {
    "questions": [
      "Have you heard of dopamine fasting? What do you think it involves, based on the name alone?",
      "How do you think modern technology and social media contribute to dopamine addiction? Have you noticed this in your own life?",
      "What are some activities that you find particularly rewarding or stimulating? Do you think you might be addicted to any of them?",
      "How do you feel about the idea of intentionally reducing or avoiding pleasurable activities to reset your brain’s reward system?",
      "Do you think dopamine fasting could be beneficial for improving focus or productivity? Why or why not?",
      "What challenges do you think someone might face when attempting a dopamine fast? How could they overcome these challenges?",
      "Have you ever tried to take a break from social media, video games, or other stimulating activities? How did it go, and what did you learn?",
      "How do you think dopamine fasting could affect mental health? Could it lead to better emotional well-being, or might it have drawbacks?",
      "In your opinion, is there a healthy balance between enjoying dopamine-inducing activities and maintaining self-control? How do you achieve that balance?",
      "Do you think the concept of dopamine fasting is a passing trend, or do you see it becoming a more widely adopted practice? Why?"
    ]
  }, 
  "Thu 1: Childhood Memories 🌟": {
    "questions": [
      "How did you spend your free time as a child? What hobbies or activities were you passionate about?",
      "What kind of student were you in school? Were you more of a studious type, or did you prefer having fun?",
      "What was your favorite subject or class in school, and why did you enjoy it?",
      "Did you participate in any clubs or extracurricular activities? What were they, and what did you enjoy about them?",
      "Do you remember having a childhood crush? How did you feel, and did you ever confess your feelings?",
      "Can you share a memorable experience from a school festival or event? What made it special?",
      "What friendships from your childhood stand out the most to you, and why were they important?",
      "What did you dream of becoming when you were a child? How did those dreams change as you grew older?",
      "What were some of your favorite songs or TV shows growing up? Do you still listen to or watch any of them?",
      "Did you have a favorite game or way to play with friends? What do you remember most about those times?"
    ]
  },
  "Thu 2: Fun and Lighthearted Debates 🎉": {
    "questions": [
      "Superpower Showdown: If you could have one superpower, what would it be, and how would you use it in everyday life?",
      "Guilty Pleasures: What’s your guilty pleasure TV show, movie, or snack that you’re slightly embarrassed to admit you love?",
      "Food Fight: Pineapple on pizza: delicious or a crime against pizza?",
      "The Ultimate Dinner Party: If you could invite three famous people (dead or alive) to a dinner party, who would you choose and why?",
      "Time Travel Choices: If you could travel to any time period in history (past or future), when would you go and what would you do?",
      "What’s the Best Pet?: What’s the best pet: dog, cat, or something else entirely?",
      "Fantasy Career Switch: If you could instantly switch careers to something completely different with no training, what would you choose?",
      "Technology Takeover: Which piece of technology has had the biggest impact on your life, and could you live without it?",
      "Social Media: Love It or Hate It?: Is social media a necessary evil, or does it do more harm than good?",
      "Would You Rather?: Would you rather always be 10 minutes late or 20 minutes early?"
    ]
  }
}