{
  "Session 1: Would You Rather? Let's Balance the Choices! 🎭": {
    "context": "Welcome to a fun and thought-provoking session of 'Would You Rather' and balance game questions! These scenarios will challenge your preferences, spark laughter, and reveal interesting insights about each other. Feel free to improvise or add your own twists as we explore these creative dilemmas together.",
    "questions": [
      "Would you rather be the worst member of a top company or K-pop idol group, or the best member of a much less competent or popular one? (Why?)",
      "Would you rather date someone who texts you every hour or only once or twice a day? (How would this affect your relationship?)",
      "Would you rather break up with a friend if you introduced them to their future spouse and they only gave you a simple thank-you lunch as a gesture of gratitude, or let it go even though you expected a more significant gift?",
      "Would you rather travel overseas with friends while working remotely every night, or spend the entire trip taking care of a friend who got sick from the very beginning of the journey?",
      "Would you prefer knowing if your partner had lived with their ex, or never finding out at all?",
      "Would you rather have unlimited time but limited money, or unlimited money but limited time? (What would you prioritize?)",
      "Would you rather always feel slightly hungry or slightly tired? (Which is easier to tolerate?)",
      "Would you rather lose all your photos or all your saved messages on your phone? (What holds more sentimental value for you?)",
      "Would you rather live in a world without music or without movies? (How would this change your life?)",
      "Would you rather have the ability to pause time for 10 seconds whenever you want, or rewind time by 10 seconds once a day?"
    ]
  },
  "Session 2: Nostalgia Meets Modernity: The Retro Tech Revival 📸": {
    "context": "In recent years, retro technology has made a surprising comeback among younger generations, particularly Gen Z. From old iPhones and digital cameras to Walkmans and vinyl records, these items are being embraced not just for their functionality but for the nostalgia and aesthetic they evoke. This trend, often referred to as 'youngtro,' reflects a desire to blend the charm of the past with the conveniences of the present. Let’s explore your thoughts and experiences with this fascinating cultural shift.",
    "questions": [
      "What’s your favorite piece of retro technology, if any? Why do you think it appeals to you or others?",
      "Have you ever used an older gadget like a vintage camera or flip phone? How did it compare to modern devices?",
      "Why do you think younger generations are drawn to retro tech, even though modern technology is often more advanced?",
      "Do you think nostalgia plays a significant role in shaping trends today? Can you share an example from your own life or observations?",
      "If you could bring back any old gadget or trend from the past, what would it be and why?"
    ]
  },
  "Session 3: Education, Social Status, and Parental Expectations in Modern Society 🎓": {
    "context": "In many societies, education is seen as a pathway to success, but in South Korea, it often becomes a defining aspect of family identity and social status. The recent viral parody of 'Daechi moms' highlighted the pressures parents face to secure the best opportunities for their children, as well as the role of luxury goods in projecting success. This session explores how education, societal expectations, and materialism intersect, encouraging you to reflect on your own experiences and perspectives.",
    "questions": [
      "How do you think education shapes social status here in Seoul? Do you notice differences between neighborhoods or communities?",
      "Have you ever felt pressure to meet societal expectations, either in education or other areas? How did you deal with it?",
      "Why do you think some people use material goods, like luxury fashion, to express their identity or social standing? Do you think this is effective or problematic?",
      "The parody video sparked both laughter and discomfort. Why do you think humor can be such a powerful way to critique societal norms? Can you share an example of satire that resonated with you?",
      "If you were a parent in a highly competitive environment like Daechi-dong, how would you balance your child's academic success with their happiness and well-being?"
    ]
  }
}
